# Клавиатуры
save_video_text = "Видео 🎾"
back_text = "Назад 🔙"
yes_text = "✅"
no_text = "❌"

# Тексты для пользователей
start_text = """Рады вас приветствовать👋
Перед тем, как сохранить видео, выберите корт на котором вы играете🎾"""

please_enter_password_text = """Для того, чтобы получить доступ к видео,введите пароль🔐
Пароль должен сообщить администратор клуба🧑‍💻"""

wrong_password_text = """Пароль не верный. Попробуете снова🙂"""

right_password_text = """Супер 🚀
Теперь вы можете сохранить видео📹"""

make_public_text = f"""Здорово🤩
Хотите, чтобы ваше видео было выгружено в наш телеграмм канала и приняло участие в еженедельной подборке дувших моментов от наших пользователей? 🚀
(Нажимая на кнопку «{yes_text}» вы автоматически даёте своё согласие)

Если же вы хотите, чтобы доступ к видео был только у вас, то нажмите кнопку «{no_text}»
"""

error_text = "Произошла ошибка, обратитесь к администратору"
public_text = "Видео теперь будет публичным"
