# Клавиатуры
save_video_text = "Видео🎾"
back_text = "Назад🔙"
yes_text = "✅"
no_text = "❌"

# Тексты для пользователей
start_text = """Рады вас приветствовать👋
Перед тем, как сохранить видео, выберите корт, на котором вы играете🎾"""

please_enter_password_text = """Для получения доступа к видео, введите пароль🔐
Пароль сообщит администратор клуба🧑‍💻"""

wrong_password_text = """Пароль неверный. Попробуйте снова🙂"""

right_password_text = """Супер🚀
Теперь вы можете сохранить видео📹"""

make_public_text = f"""Здорово🤩
Хотите, чтобы ваше видео было выгружено на канале и приняло участие в подборке лучших игровых моментов RESHOOT?🚀
(Нажимая на кнопку «{yes_text}», вы автоматически даёте своё согласие)

Если вы хотите, чтобы доступ к видео был только у вас, нажмите кнопку «{no_text}»
"""

saving_video_text = "В течение минуты видео появится здесь✅"
error_text = "Произошла ошибка, обратитесь к администратору"
public_text = "Видео будет находиться в открытом доступе"
